import java.util.Scanner;

public class p6 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //Да се напише програма, която проверява сумата и произведението на всички числа, които са комбинация от четирите цифри a, b, c и d.
        //В проверката участва и още едно число - n, което се чете от конзолата.
        //За всяка комбинация четирите цифри a, b, c и d се променят по следния начин:
        //a се мени от 1 до 9
        //b се мени от 9 до а
        //c се мени от 0 до 9
        //d се мени от 9 до c
        //Ако сумата (a + b + c + d) е равна на произведението (a * b * c * d) и едновременно с това n завършва на 5, трябва да се принтира числото abcd.
        //Ако разделим произведението (a * b * c * d) на сумата (a + b + c + d) и получим 3 (целочислено), и едновременно с това n се дели на 3 без остатък,
        // трябва да се принтира числото dcba.
        //Програмата трябва да принтира на конзолата само първата валидна комбинация.
        //Ако не се намери такова число abcd или dcba, трябва да се принтира "Nothing found".

        //Вход:
        //От конзолата се прочита 1 ред:
        //n - цяло число в интервала [100…1000]

        //Изход:
        //На конзолата се отпечатва 1 ред:
        //Ако се намери валидна комбинация:
        //"{number}", където {number} е комбинацията abcd или комбинацията dcba
        //Ако НЕ се намери такава комбинация:
        //"Nothing found"

        int n = Integer.parseInt(scanner.nextLine());
        int count = 0;


        for (int a = 1; a <= 9; a++) {
            for (int b = 9; b >= a; b--) {
                for (int c = 1; c <= 9; c++) {
                    for (int d = 8; d >= c; d--) {

                        double num1 = a + b + c + d;
                        double num2 = a * b * c * d;

                        if (num1 == num2 && n % 10 == 5) {
                            System.out.printf("%d" + "%d" + "%d" + "%d",a,b,c,d);

                            return;
                        } else if (num2 / num1  % 3 == 0 && n % 3 == 0) {

                            System.out.printf("%d" + "%d" + "%d" + "%d",d,c,b,a);

                            return;
                        }

                    }
                }
            }
        }

            System.out.println("Nothing found");

    }
}
