import java.util.Scanner;

public class TheSongOfTheWheels {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //Прапраправнукът на Сали Яшар е получил наследство - сейф с парола - четири цифри. В него е заключена тайната на пеещите каруци.
        // Той има автосервиз и се нуждае от реклама, затова е решил да направи такава каруца. Проблема е, че паролата е скрита в следната задача:

        //„Парола ще получиш, ако знаеш  едно цяло число, контролна стойност  се нарича то,
        //почива в интервала от 4 до 144 включително, но да го откриеш може би ще е мъчително. ”
        //Паролата има формат: "abcd" и контролната стойност трябва да е равна на  a*b + c*d , но трябва да бъдат спазени следните условия:

        //при намирането на а и b: a < b
        //при намиране на  c и d: c > d
        //a, b, c и d са числа в интервала [1 - 9]
        //Каруцата  има четири колела, затова паролата ще е четвърто число, което трябва да се отпечата.
        //В случай, че НЕ се намери такова число,  отпечатва се „No!“.

        //Вход
        //От конзолата се чете едно цяло число (контролната стойност): M – цяло число в интервала [4 … 144];

        //Изход
        //Отпечатването на конзолата зависи от резултата:
        //Ако са намерени четворки числа (аbcd), отговарящи на условието, ги отпечатваме всичките с разделител интервал: “{а}{b}{c}{d} ”
        //Отпечатва се един от двата реда на нов ред:
        //Ако съществува четвърта четворка се отпечатва: „Password: {а}{b}{c}{d}“
        //Ако НЕ са намерени такива числа или няма  четвърта четворка отпечатваме: “No!”

        int M = Integer.parseInt(scanner.nextLine());

        int counter = 0;
        int a1 = 0;
        int b1 = 0;
        int c1 = 0;
        int d1 = 0;
        for (int a = 1; a <= 9; a++) {
            for (int b = 1; b <= 9; b++) {
                for (int c = 1; c <= 9; c++) {
                    for (int d = 1; d <= 9; d++) {

                        if (a < b && c > d && a * b + c * d == M) {
                            counter++;
                            System.out.printf("%d%d%d%d ", a, b, c, d);
                            if (counter == 4) {
                                a1 = a;
                                b1 = b;
                                c1 = c;
                                d1 = d;
                            }

                        }


                    }
                }
            }
        }
        if (counter >= 4) {
            System.out.printf("\nPassword: %d%d%d%d", a1, b1, c1, d1);
        } else {
            System.out.println("\nNo!");
        }
    }

}

